lib/export_client/client.rb

SELECT "exports".* FROM "exports" WHERE "exports"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
    def fetch(id)
      @export = Export.find_by_id(id)