app/controllers/export_controller.rb

  def create
    @export = Export.new export_params
    set_default_params(@export)
    if @export.save
---
INSERT INTO "exports" ("domain", "api_key", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def set_export
    @export = Export.find_by_id(params[:id])
---
SELECT "exports".* FROM "exports" WHERE "exports"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]